</s> 25000
. 81838
, 40958
mph 33395
with 33102
a 32465
of 25083
<s> 25000
wind 25000
<unk> 25000
and 24379
between 20333
high 18832
around 17253
as 15220
cloudy 12737
near 12355
Mostly 12306
low 11355
chance 9792
is 9657
precipitation 9632
Chance 9623
% 9623
A 8692
showers 7005
becoming 6739
20 6680
10 6135
South 6041
to 5669
5 5588
gusts 5501
after 5342
before 4771
rain 4678
15 4503
30 4407
sunny 3950
possible 3856
south 3744
amounts 3705
New 3625
Breezy 3461
Partly 3423
West 3384
percent 3319
inch 3268
rainfall 3051
6 2966
Cloudy 2920
southeast 2899
7 2897
8 2866
southwest 2835
then 2796
an 2791
thunderstorms 2727
9 2723
could 2683
noon 2671
snow 2650
mainly 2648
40 2640
11 2573
likely 2565
Calm 2543
13 2415
slight 2289
25 2217
Southwest 2216
50 2165
tenth 2058
west 2050
Winds 2029
gust 2029
midnight 1992
14 1901
Showers 1888
East 1778
60 1747
quarter 1665
northwest 1598
fog 1574
Otherwise 1540
or 1440
increasing 1433
Sunny 1423
16 1403
less 1385
than 1385
3 1352
18 1351
Northwest 1341
Rain 1339
calm 1326
Patchy 1322
accumulation 1246
17 1240
North 1197
clear 1177
70 1166
Low 1160
21 1140
39 1136
Southeast 1128
mostly 1125
possibly 1116
thunderstorm 1102
east 1099
drizzle 1094
Windy 1062
10am 1035
clouds 1024
80 1020
35 999
90 972
Increasing 941
half 927
23 904
High 900
the 892
33 848
22 822
38 816
in 803
46 785
10pm 784
except 782
higher 782
24 764
45 756
northeast 741
43 727
41 726
47 711
32 709
36 705
Some 684
9am 677
31 673
42 670
Light 670
north 664
gradually 659
34 653
storms 650
48 648
26 645
44 623
28 616
37 608
29 604
52 582
51 578
3am 578
49 559
55 553
4 545
Little 544
no 544
expected 544
Snow 529
1am 526
53 524
1pm 521
63 499
58 476
54 466
at 446
59 446
61 436
3pm 435
feet 433
56 430
11am 410
freezing 406
57 385
one 378
100 376
62 366
11pm 366
inches 357
4pm 356
19 339
be 337
Periods 335
severe 333
produce 326
12 309
partly 306
level 300
74 282
by 280
Areas 279
heavy 279
4am 278
75 277
rising 276
decreasing 275
Occasional 261
67 260
73 258
27 257
68 255
Scattered 254
sleet 253
66 249
variable 248
64 242
falling 232
also 231
71 227
69 215
76 214
72 213
Temperature 213
65 208
Isolated 196
during 193
two 183
8am 181
9pm 177
winds 163
6pm 163
2pm 162
Clear 161
remainder 153
day 150
temperature 149
Northeast 149
77 148
three 142
quarters 141
78 139
damaging 125
Wind 123
chill 123
values 123
ice 117
1 113
early 98
2 98
81 94
flurries 86
light 82
79 81
Freezing 73
steady 69
gradual 62
clearing 62
5pm 59
lowering 58
occasional 53
2am 49
5am 46
evening 40
frost 39
through 39
mid 39
morning 39
gusty 38
300 38
82 36
8pm 35
500 35
thunder 34
scattered 31
Widespread 31
sprinkles 30
1000 30
Blustery 28
0.1 26
5500 25
5100 24
all 24
afternoon 21
blowing 20
600 16
5200 15
mixed 14
0.3 14
Steady 13
small 13
hail 13
4900 13
dust 12
5800 11
84 11
400 11
83 9
zero 9
1500 9
1200 9
900 9
5300 8
6200 8
700 8
cold 8
5700 7
1900 7
-1 7
85 7
7am 7
4300 7
3000 7
5000 7
areas 7
5600 7
-6 6
2400 6
1400 6
2500 6
4200 6
4100 5
200 5
4000 5
Flurries 5
7pm 5
0 4
4800 4
periods 4
3200 4
-2 4
5900 4
4600 4
-4 4
The 4
times 4
6100 4
2200 3
2100 3
1800 3
for 3
800 3
-3 3
1300 3
6000 3
Definite 3
1600 3
night 3
1700 3
3100 2
3400 2
2000 2
-29 2
3700 2
ending 2
4700 2
3900 2
1100 2
5400 2
2600 2
-40 2
3800 2
2700 2
86 2
toward 2
daybreak 2
3300 2
overnight 2
-5 2
-25 2
-18 1
-19 1
-30 1
2300 1
6400 1
2800 1
-14 1
-13 1
88 1
87 1
-9 1
-33 1
-7 1
-10 1
-35 1
-49 1
-41 1
blustery 1
2900 1
-11 1
Very 1
windy 1
-48 1
-21 1
-28 1
6300 1
0.2 1
0.4 1
89 1
